# Bloque 1

## Video 3

De las siguientes opciones ¿Cuál sería la entidad básica de MySQL?

---

Tabla.
¡Alternativa correcta! Efectivamente, la tabla es la entidad básica de MySQL.

## Video 4

¿Qué es una clave primaria?

---

Es una restricción que determina que el valor de estos campos debe existir en otra tabla.


¡Alternativa incorrecta! Esta es la definición de clave externa.

## Video 5

2. Marca las alternativas verdaderas que representan requisitos para el inicio de la construcción de una base de datos.

---

**Entender las reglas del negocio.**

Este es uno de los requisitos mencionados en el video.

**Diseño de un modelo que corresponda con la realidad.**


¡Alternativa correcta! Este es uno de los requisitos mencionados en el video.

1. Marca las alternativas verdaderas que representan los pasos para la creación de un modelo conceptual.

---

**Establecer la cardinalidad entre las entidades.**


Este es uno de los requisitos mencionados en el video.


**Construcción del diagrama Entidad-Relación.**


Este es uno de los requisitos mencionados en el video.

# Bloque 2

## Video 1

¿Qué significa el parámetro DEFAULT CHARACTER SET usado en la creación de la base de datos en MySQL?

---

Hace referencia a la tabla de caracteres que será utilizada al almacenar campos de texto.


¡Alternativa correcta! Aquí especificamos la tabla ASCII de caracteres que serán empleados en la base de datos.

## Video 2

Crea la tabla de clientes con base en el diagrama de entidades de la definición de la base de datos ventas_jugos como se muestra a continuación:

![01](img/01.JPG)

- Crea la tabla de clientes empleando líneas de comando SQL.

- El nombre de la tabla debe ser clientes.

- Observación: El nombre de los campos mencionados está en lenguaje natural. Debemos crear los campos de la siguiente forma:

-      DNI / NOMBRE / DIRECCION / BARRIO / CIUDAD / ESTADO / CP / FECHA_NACIMIENTO / EDAD / SEXO /         LIMITE_CREDITO / VOLUMEN_COMPRA / PRIMERA_COMPRA

---

  ```sql
CREATE TABLE clientes (
  DNI varchar(11) NOT NULL,
  NOMBRE varchar(100) DEFAULT NULL,
  DIRECCION varchar(150) DEFAULT NULL,
  BARRIO varchar(50) DEFAULT NULL,
  CIUDAD varchar(50) DEFAULT NULL,
  ESTADO varchar(45) DEFAULT NULL,
  CP varchar(8) DEFAULT NULL,
  FECHA_NACIMIENTO date DEFAULT NULL,
  EDAD int(2) DEFAULT NULL,
  SEXO varchar(1) DEFAULT NULL,
  LIMITE_CREDITO float DEFAULT NULL,
  VOLUMEN_COMPRA float DEFAULT NULL,
  PRIMERA_COMPRA bit(1) DEFAULT NULL,
  PRIMARY KEY (DNI));  
  ```

## Video 3

Crea la tabla de facturas con base en el diagrama de entidades de la definición de la base de datos ventas_jugos como se muestra a continuación usando el asistente:

![02](img/02.JPG)

- El nombre de la tabla debe ser facturas.

- Observación: El nombre de los campos mencionados está en lenguaje natural. Debemos crear los campos de la siguiente forma:

-       NUMERO / FECHA / DNI / MATRICULA / IMPUESTO

---

En la base de datos de ventas_jugos hay que hacer clic derecho sobre Tables:

![03](img/03.JPG)

En el asistente de la creación de tablas digita:

![04](img/04.JPG)

Guarda la tabla como facturas.

## Video 4

Crea, por línea de comando, la clave externa que relaciona a la tabla facturas con items_facturas a través del campo NUMERO.

---

```sql
USE ventas_jugos;

CREATE TABLE items_facturas
(NUMERO VARCHAR(5) NOT NULL,
CODIGO VARCHAR(10) NOT NULL,
CANTIDAD INT,
PRECIO FLOAT,
PRIMARY KEY (NUMERO, CODIGO));

ALTER TABLE items_facturas ADD CONSTRAINT FK_FACTURAS
FOREIGN KEY (NUMERO)
REFERENCES facturas(NUMERO);
```

## Video 5

La gerencia de la empresa de jugos realizó la solicitud de cambiar los nombres de las tablas colocando el prefijo tb_ antes de cada nombre.

---

```sql
ALTER TABLE factura RENAME tb_factura;
ALTER TABLE cliente RENAME tb_cliente;
ALTER TABLE items_facturas RENAME tb_items_facturas;
```

## Video 6

Para finalizar la creación de la base de datos, hacen falta dos tablas que son: ``tb_producto`` y tb_vendedor. (No olvides crear las claves externas que vinculan a ``tb_producto`` con tb_items_facturas, a tb_facturas con tb_clientes y a tb_facturas con tb_vendedor).

![05](img/05.JPG)

![06](img/06.JPG)

---

```sql
USE ventas_jugos;

CREATE TABLE tb_vendedor(
MATRICULA VARCHAR(5) NOT NULL,
NOMBRE VARCHAR(100) NULL,
BARRIO VARCHAR(50) NULL,
COMISION FLOAT NULL,
FECHA_ADMISION DATE NULL,
DE_VACACIONES BIT(1) NULL,
PRIMARY KEY(MATRICULA)
);

CREATE TABLE tb_producto(
CODIGO VARCHAR(10) NOT NULL,
DESCRIPCION VARCHAR(100) NULL,
SABOR VARCHAR(50) NULL,
TAMANO VARCHAR(50) NULL,
ENVASE VARCHAR(50) NULL,
PRECIO_LISTA FLOAT NULL,
PRIMARY KEY (CODIGO)
);

ALTER TABLE tb_facturas ADD CONSTRAINT FK_CLIENTE
FOREIGN KEY (DNI) REFERENCES tb_cliente(DNI);

ALTER TABLE tb_facturas ADD CONSTRAINT FK_VENDEDOR
FOREIGN KEY (MATRICULA) REFERENCES tb_vendedor(MATRICULA);

ALTER TABLE tb_items_facturas ADD CONSTRAINT FK_PRODUCTO
FOREIGN KEY (CODIGO) REFERENCES tb_producto(CODIGO);
```

# Bloque 3

## Video 1

Incluye los siguientes registros en la tabla de clientes:

DNI: 9283760794, NOMBRE: Edson Calisaya, DIRECCION: Sta Úrsula Xitla, BARRIO: Barrio del Niño Jesús, CIUDAD: Ciudad de México, ESTADO: EM, CP: 22002002, FECHA DE NACIMIENTO: 1995-01-07, EDAD: 25, SEXO: M, LIMITE DE CREDITO: 150000, VOLUMEN DE COMPRA: 250000, PRIMERA COMPRA: Sí.

DNI: 7771579779, NOMBRE: Marcelo Perez, DIRECCION: F.C. de Cuernavaca 13, BARRIO: Carola, CIUDAD: Ciudad de México, ESTADO: EM, CP: 88202912, FECHA DE NACIMIENTO: 1992-01-25, EDAD: 29, SEXO: M, LIMITE DE CREDITO: 70000, VOLUMEN DE COMPRA: 160000, PRIMERA COMPRA: Sí.

DNI: 5576228758, NOMBRE: Patricia Olivera, DIRECCION: Pachuca 75, BARRIO: Condesa, CIUDAD: Ciudad de México, ESTADO: EM, CP: 88192029, FECHA DE NACIMIENTO: 1995-01-14 , EDAD: 25, SEXO: F, LIMITE DE CREDITO: 70000, VOLUMEN DE COMPRA: 160000, PRIMERA COMPRA: Sí.

---

```sql
INSERT INTO TABLA_DE_CLIENTES (DNI, NOMBRE, DIRECCION, BARRIO, CIUDAD, ESTADO, CP, FECHA_NACIMIENTO, EDAD, SEXO, LIMITE_CREDITO, VOLUMEN_COMPRA, PRIMERA_COMPRA) VALUES ('9283760794', 'Edson Calisaya', 'Sta Úrsula Xitla', 'Barrio del Niño Jesús', 'Ciudad de México', 'EM', '22002002', '1995-01-07', 25, 'M', 150000, 250000, 1);
INSERT INTO TABLA_DE_CLIENTES (DNI, NOMBRE, DIRECCION, BARRIO, CIUDAD, ESTADO, CP, FECHA_NACIMIENTO, EDAD, SEXO, LIMITE_CREDITO, VOLUMEN_COMPRA, PRIMERA_COMPRA) VALUES ('7771579779', 'Marcelo Perez', 'F.C. de Cuernavaca 13', 'Carola', 'Ciudad de México', 'EM', '88202912', '1992-01-25', 29, 'M', 120000, 200000, 1);
INSERT INTO TABLA_DE_CLIENTES (DNI, NOMBRE, DIRECCION, BARRIO, CIUDAD, ESTADO, CP, FECHA_NACIMIENTO, EDAD, SEXO, LIMITE_CREDITO, VOLUMEN_COMPRA, PRIMERA_COMPRA) VALUES ('5576228758', 'Patricia Olivera', 'Pachuca 75',  'Condesa', 'Ciudad de México', 'EM', '88192029', '1995-01-14', 25, 'F', 70000, 160000, 1);
```

## Video 2

Incluye todos los clientes en la tabla tb_clientes basado en los registros de la tabla tabla_de_clientes de la base jugos_ventas.

Observación: Atención al nombre de los campos y recuerda que ya incluimos 3 clientes en nuestra tabla durante el ejercicio anterior.

---

```sql
USE ventas_jugos;

INSERT INTO tb_clientes
SELECT DNI, NOMBRE, DIRECCION_1 AS DIRECCION,
BARRIO, CIUDAD, ESTADO, CP, FECHA_DE_NACIMIENTO 
AS FECHA_NACIMIENTO, EDAD, SEXO, LIMITE_DE_CREDITO
AS LIMITE_CREDITO, VOLUMEN_DE_COMPRA AS VOLUMEN_COMPRA,
PRIMERA_COMPRA FROM jugos_ventas.tabla_de_clientes
WHERE DNI NOT IN (SELECT DNI FROM tb_clientes);
```

## Video 4

![07](img/07.JPG)

¿Qué representan los campos resaltados en rojo?

Las columnas del archivo .csv.


¡Alternativa correcta! Primero se presentan las columnas del archivo .csv.

# Bloque 4

## Video 1

Actualiza la dirección del cliente con el DNI 5840119709 Colocando como nueva dirección Jorge Emilio 23, barrio San Antonio, ciudad Guadalajara, Estado de Jalisco y el CP 44700000.

---

```sql
UPDATE tb_clientes SET 
DIRECCION = 'Jorge Emilio 23',
BARRIO = 'San Antonio',
CIUDAD = 'Guadalajara',
ESTADO = 'JC',
CEP = '44700000'
WHERE DNI = '5840119709'
```

## Video 2

Podemos observar que los vendedores se encuentran en barrios asociados a ellos. Vamos a aumentar en 30% el volumen de compra de los clientes que tienen, en sus direcciones, barrios donde los vendedores cuentan con oficinas.

Tip: Vamos a usar un UPDATE con FROM apoyándonos con el siguiente INNER JOIN:

```sql
SELECT A.DNI FROM tb_clientes A
INNER JOIN tb_vendedor B
ON A.BARRIO = B.BARRIO
```

---

```sql
UPDATE tb_clientes A 
INNER JOIN 
tb_vendedor B
ON A.BARRIO = B.BARRIO
SET A.VOLUMEN_COMPRA = A.VOLUMEN_COMPRA * 1.3
```

## Video 3

Vamos a excluir las facturas (Apenas el encabezado) cuyos clientes tengan menos de 18 años.

Tip: Usaremos la siguiente consulta:

```sql
SELECT A.DNI FROM tb_clientes A
INNER JOIN tb_vendedor B
ON A.BARRIO = B.BARRIO
```

Puedes usar una sintaxis semejante a la usada en UPDATE con FROM.

---

```sql
DELETE A FROM tb_facturas A
INNER JOIN 
tb_clientes B 
ON A.DNI = B.DNI
WHERE B.EDAD < 18;
```

## Video 4

¿Por qué debemos tener cuidado al usar comandos UPDATE o DELETE sin condiciones con la cláusula WHERE?

---

Porque no lograremos recuperar los datos en caso que ejecutemos un comando sin la cláusula WHERE sobre toda la tabla.


¡Alternativa correcta! Este es el principal cuidado que debemos tener.

## Video 5

¿Se presentarán errores al utilizar el comando ROLLBACK dos veces?

---

No, porque podemos usar comandos ROLLBACK simultáneos en el mismo script.


¡Alternativa correcta! Podemos usar ROLLBACKs seguidos en un mismo script, aunque no haya iniciado una nueva transacción. Pero, el comando se torna inútil porque nada va a suceder.

# Bloque 5

## Video 1

¿Cuál será el valor final de la secuencia tras la ejecución de los siguientes comandos?

```sql
CREATE TABLE TAB_IDENTITY2 (ID INT AUTO_INCREMENT, DESCRIPTOR VARCHAR(20), PRIMARY KEY(ID));
INSERT INTO TAB_IDENTITY2 (DESCRIPTOR) VALUES ('CLIENTE1');
INSERT INTO TAB_IDENTITY2 (DESCRIPTOR) VALUES ('CLIENTE2');
INSERT INTO TAB_IDENTITY2 (DESCRIPTOR) VALUES ('CLIENTE3');
INSERT INTO TAB_IDENTITY2 (ID, DESCRIPTOR) VALUES (NULL, 'CLIENTE4');
DELETE FROM TAB_IDENTITY2 WHERE ID = 3;
INSERT INTO TAB_IDENTITY2 (ID, DESCRIPTOR) VALUES (NULL, 'CLIENTE6');
INSERT INTO TAB_IDENTITY2 (ID, DESCRIPTOR) VALUES (NULL, 'CLIENTE7');
DELETE FROM TAB_IDENTITY2 WHERE ID = 2;
```

---

El valor final de la secuencia será 6.

## Video 2

¿Un campo que fue definido como estándar al momento de la creación de la tabla, presentará qué tipo de comportamiento durante el INSERT?

---

Si el mismo no aparece en el comando INSERT, será incluido el valor DEFAULT que fue especificado al momento de la creación de la tabla.


¡Alternativa correcta! Así es como funcionan los campos con valores DEFAULT.

## Video 4

El siguiente comando SQL calcula la edad actual del cliente:

```sql
SELECT DNI, EDAD, FECHA_NACIMIENTO, timestampdiff(YEAR, FECHA_NACIMIENTO, NOW()) AS ANOS FROM tb_clientes;
```

Construye un TRIGGER (Lo llamaremos TG_EDAD_CLIENTES_INSERT) que actualiza las edades de los clientes, en la tabla de clientes, siempre que la tabla sufra una inclusión.

---

```sql
DELIMITER //
CREATE TRIGGER TG_EDAD_CLIENTES_INSERT 
BEFORE INSERT ON tb_clientes
FOR EACH ROW BEGIN
SET NEW.EDAD = timestampdiff(YEAR, NEW.FECHA_NACIMIENTO, NOW());
END//
```

## Video 5

¿Cuáles de los siguientes comandos pueden trabajar con TRIGGERs en MySQL?

---

Todas las anteriores.


¡Alternativa correcta! Así es, los comandos INSERT, UPDATE y DELETE pueden trabajar con TRIGGERs en MySQL.

## Video 6

¿Cuál de los siguientes lenguajes de programación no sirve para manipular datos?

---

Ninguno de los anteriores.


¡Alternativa correcta! Todos los programas anteriormente mencionados son muy útiles para trabajar con manipulación de datos.